run/NACA0010__AoA0_k-omega/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          2400;
        startFace       739135;
    }
    outlet
    {
        type            patch;
        nFaces          315;
        startFace       741535;
    }
    foil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1015;
        startFace       741850;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          741000;
        startFace       742865;
    }
)

// ************************************************************************* //
