run/NACA0010__AoA0_k-omega/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

															
scale 1;														
                                                                
geometry																
{																
}	

vertices
(
               															
	                     ( 0.0 0.0 0.0) // 0
   ( 1.0 0.0010499999999999815 0.0) // 1
                    ( 1.0 10.0 0.0) // 2
                   ( -10.0 0.0 0.0) // 3
  ( 15.0 0.0010499999999999815 0.0) // 4
                   ( 15.0 10.0 0.0) // 5
  ( 1.0 -0.0010499999999999815 0.0) // 6
 ( 15.0 -0.0010499999999999815 0.0) // 7
                   ( 1.0 -10.0 0.0) // 8
                  ( 15.0 -10.0 0.0) // 9
                    ( 0.0 0.0 1.0) // 10
  ( 1.0 0.0010499999999999815 1.0) // 11
                   ( 1.0 10.0 1.0) // 12
                  ( -10.0 0.0 1.0) // 13
 ( 15.0 0.0010499999999999815 1.0) // 14
                  ( 15.0 10.0 1.0) // 15
 ( 1.0 -0.0010499999999999815 1.0) // 16
( 15.0 -0.0010499999999999815 1.0) // 17
                  ( 1.0 -10.0 1.0) // 18
                 ( 15.0 -10.0 1.0) // 19 
        );
        
blocks																
(																
	hex	(0 1 2 3 10 11 12 13)	( 500 150 1) simpleGrading (1 1000 1)   //block	0
																													
	hex	(1 4 5 2 11 14 15 12)	( 700 150 1) simpleGrading (15 1000 1)  //block	1														
               											
	hex	(6 7 4 1 16 17 14 11)	( 700 15 1) simpleGrading (15 1 1)      //block	2
																																								
	hex	(8 9 7 6 18 19 17 16)	( 700 150 1) simpleGrading (15 0.001 1) //block	3	
	
	hex	(3 8 6 0 13 18 16 10)	( 500 150 1) simpleGrading (1 0.001 1)  //block	4								
);		

edges																
(																
	arc	2 3	(-7 7 0)									
	arc	12 13	(-7 7 1)
	arc	8 3	(-7 -7 0)									
	arc	18 13	(-7 -7 1)									
																
	spline	0 1													
	(					      

                                         ( 0.0 0.0 0 ) 
 ( 0.00024671981657042874 0.002316197204902843 0 ) 
  ( 0.0009866357836101902 0.004600598129393101 0 ) 
  ( 0.0022190176933925554 0.006852290391005644 0 ) 
   ( 0.003942649333762649 0.009070141684821726 0 ) 
   ( 0.006155829688391956 0.011252806756428759 0 ) 
   ( 0.008856374615475837 0.013398736989871502 0 ) 
   ( 0.012041619003218151 0.015506192495134982 0 ) 
   ( 0.015708419399974638 0.017573256549436388 0 ) 
    ( 0.01985315711646002 0.019597852218326335 0 ) 
    ( 0.02447174179695788 0.021577760956684414 0 ) 
   ( 0.029559615456007327 0.023510642966489373 0 ) 
    ( 0.03511175697658486 0.025394059068060058 0 ) 
    ( 0.04112268706534028 0.027225493824557356 0 ) 
    ( 0.047586473659998074 0.02900237964613257 0 ) 
     ( 0.05449673778358616 0.03072212159036338 0 ) 
     ( 0.06184665983971649 0.03238212256965291 0 ) 
     ( 0.06962898634270315 0.03397980867413402 0 ) 
    ( 0.07783603707587677 0.035512654320327734 0 ) 
     ( 0.08645971267103159 0.03697820694129733 0 ) 
       ( 0.0954915026015235 0.0383741109432143 0 ) 
     ( 0.10492249358113281 0.03969813066595252 0 ) 
     ( 0.11474337836040116 0.04094817210134502 0 ) 
    ( 0.12494446491176331 0.042122303141821256 0 ) 
     ( 0.13551568599440833 0.04321877215399728 0 ) 
     ( 0.1464466090894303 0.044236024696083474 0 ) 
      ( 0.1577264466954656 0.04517271822433904 0 ) 
    ( 0.16934406697465365 0.046027734661848146 0 ) 
     ( 0.18128800473841744 0.04680019073220441 0 ) 
     ( 0.1935464727622202 0.047489445990842184 0 ) 
      ( 0.20610737341813284 0.0480951085173074 0 ) 
      ( 0.21895831061373222 0.0486170382622798 0 ) 
       ( 0.2320866020255476 0.0490553480732082 0 ) 
    ( 0.24547929161498316 0.049410402451580855 0 ) 
     ( 0.2591231624143632 0.049682814122716606 0 ) 
      ( 0.273004749570484 0.049873438525149416 0 ) 
        ( 0.287110353632798 0.0499833663508374 0 ) 
     ( 0.30142605407311807 0.05001391428923613 0 ) 
       ( 0.315937723023497 0.04996661414745782 0 ) 
      ( 0.3306310392187286 0.04984320053505298 0 ) 
      ( 0.345491502129707 0.049645597315207214 0 ) 
      ( 0.3605044462736979 0.04937590303420085 0 ) 
       ( 0.3756550556873999 0.0490363755477345 0 ) 
       ( 0.3909283785485107 0.0486294160661414 0 ) 
     ( 0.40630934193137186 0.04815755284058916 0 ) 
      ( 0.4217827666821252 0.04762342470918232 0 ) 
     ( 0.43733338239870584 0.04702976471551642 0 ) 
      ( 0.4529458425008854 0.04637938400285951 0 ) 
       ( 0.468604739375493 0.04567515617494655 0 ) 
      ( 0.4842946195818704 0.04492000229960272 0 ) 
     ( 0.4999999991025516 0.044116876714342015 0 ) 
      ( 0.5157053786241185 0.04326875377402137 0 ) 
        ( 0.5313952588331522 0.042378615659903 0 ) 
      ( 0.5470541557121839 0.04144944134744678 0 ) 
      ( 0.5626666158205507 0.04048419680718636 0 ) 
     ( 0.5782172315450762 0.039485826489522195 0 ) 
        ( 0.593690656305524 0.0384572461205747 0 ) 
     ( 0.6090716196998196 0.037401336812760505 0 ) 
      ( 0.6243449425740935 0.03632094047086331 0 ) 
      ( 0.6394955520026742 0.03521885645241817 0 ) 
      ( 0.6545084961632448 0.03409783942056344 0 ) 
     ( 0.6693689590924875 0.032960598308441155 0 ) 
      ( 0.6840622753076503 0.03180979629703788 0 ) 
     ( 0.6985739442796073 0.030648051693296024 0 ) 
     ( 0.7128896447431308 0.029477939582607394 0 ) 
     ( 0.7269952488302514 0.028301994119595303 0 ) 
     ( 0.7408768360127569 0.027122711313527698 0 ) 
     ( 0.7545207068400739 0.025942552159863144 0 ) 
      ( 0.7679133964589709 0.02476394596735382 0 ) 
      ( 0.7810416879017434 0.02358929373080549 0 ) 
     ( 0.7938926251297652 0.022420971402967574 0 ) 
     ( 0.8064535258195331 0.021261332925002503 0 ) 
     ( 0.8187119938785907 0.020112712883419988 0 ) 
      ( 0.8306559316789744 0.01897742867207945 0 ) 
      ( 0.8422735519961111 0.01785778205064566 0 ) 
      ( 0.853553389641386 0.016756060005484383 0 ) 
        ( 0.8644843127769004 0.015674534835124 0 ) 
      ( 0.8750555339012502 0.01461546339979274 0 ) 
     ( 0.8852566204954886 0.013581085492846475 0 ) 
      ( 0.8950775053187623 0.01257362131080364 0 ) 
     ( 0.9045084963434626 0.011595268017859497 0 ) 
     ( 0.9135402863200868 0.010648195419827915 0 ) 
     ( 0.9221639619623694 0.009734540781116963 0 ) 
     ( 0.9303710127436202 0.008856402836261587 0 ) 
     ( 0.9381533392955854 0.008015835064403627 0 ) 
      ( 0.9455032614015477 0.00721483831063556 0 ) 
     ( 0.9524135255757721 0.006455352852046209 0 ) 
      ( 0.9588773122218202 0.00573925001838952 0 ) 
     ( 0.9648882423626697 0.005068323487337753 0 ) 
     ( 0.9704403839359932 0.004444280382114217 0 ) 
     ( 0.9755282576483886 0.003868732304800629 0 ) 
    ( 0.9801468423827797 0.0033431864416923543 0 ) 
     ( 0.9842915801536527 0.002869036877692313 0 ) 
    ( 0.9879583806052372 0.0024475562548834096 0 ) 
    ( 0.9911436250481941 0.0020798879061494358 0 ) 
    ( 0.9938441700308243 0.0017670385881010595 0 ) 
    ( 0.9960573504412771 0.0015098719287370832 0 ) 
    ( 0.9977809821376927 0.0013091026943897535 0 ) 
    ( 0.9990133641036874 0.0011652919677620777 0 ) 
    ( 0.9997532801270506 0.0010788433145000886 0 ) 
                   ( 1.0 0.0010499999999999815 0 )  
    )
    spline 10 11
    (
                                         ( 0.0 0.0 1 ) 
 ( 0.00024671981657042874 0.002316197204902843 1 ) 
  ( 0.0009866357836101902 0.004600598129393101 1 ) 
  ( 0.0022190176933925554 0.006852290391005644 1 ) 
   ( 0.003942649333762649 0.009070141684821726 1 ) 
   ( 0.006155829688391956 0.011252806756428759 1 ) 
   ( 0.008856374615475837 0.013398736989871502 1 ) 
   ( 0.012041619003218151 0.015506192495134982 1 ) 
   ( 0.015708419399974638 0.017573256549436388 1 ) 
    ( 0.01985315711646002 0.019597852218326335 1 ) 
    ( 0.02447174179695788 0.021577760956684414 1 ) 
   ( 0.029559615456007327 0.023510642966489373 1 ) 
    ( 0.03511175697658486 0.025394059068060058 1 ) 
    ( 0.04112268706534028 0.027225493824557356 1 ) 
    ( 0.047586473659998074 0.02900237964613257 1 ) 
     ( 0.05449673778358616 0.03072212159036338 1 ) 
     ( 0.06184665983971649 0.03238212256965291 1 ) 
     ( 0.06962898634270315 0.03397980867413402 1 ) 
    ( 0.07783603707587677 0.035512654320327734 1 ) 
     ( 0.08645971267103159 0.03697820694129733 1 ) 
       ( 0.0954915026015235 0.0383741109432143 1 ) 
     ( 0.10492249358113281 0.03969813066595252 1 ) 
     ( 0.11474337836040116 0.04094817210134502 1 ) 
    ( 0.12494446491176331 0.042122303141821256 1 ) 
     ( 0.13551568599440833 0.04321877215399728 1 ) 
     ( 0.1464466090894303 0.044236024696083474 1 ) 
      ( 0.1577264466954656 0.04517271822433904 1 ) 
    ( 0.16934406697465365 0.046027734661848146 1 ) 
     ( 0.18128800473841744 0.04680019073220441 1 ) 
     ( 0.1935464727622202 0.047489445990842184 1 ) 
      ( 0.20610737341813284 0.0480951085173074 1 ) 
      ( 0.21895831061373222 0.0486170382622798 1 ) 
       ( 0.2320866020255476 0.0490553480732082 1 ) 
    ( 0.24547929161498316 0.049410402451580855 1 ) 
     ( 0.2591231624143632 0.049682814122716606 1 ) 
      ( 0.273004749570484 0.049873438525149416 1 ) 
        ( 0.287110353632798 0.0499833663508374 1 ) 
     ( 0.30142605407311807 0.05001391428923613 1 ) 
       ( 0.315937723023497 0.04996661414745782 1 ) 
      ( 0.3306310392187286 0.04984320053505298 1 ) 
      ( 0.345491502129707 0.049645597315207214 1 ) 
      ( 0.3605044462736979 0.04937590303420085 1 ) 
       ( 0.3756550556873999 0.0490363755477345 1 ) 
       ( 0.3909283785485107 0.0486294160661414 1 ) 
     ( 0.40630934193137186 0.04815755284058916 1 ) 
      ( 0.4217827666821252 0.04762342470918232 1 ) 
     ( 0.43733338239870584 0.04702976471551642 1 ) 
      ( 0.4529458425008854 0.04637938400285951 1 ) 
       ( 0.468604739375493 0.04567515617494655 1 ) 
      ( 0.4842946195818704 0.04492000229960272 1 ) 
     ( 0.4999999991025516 0.044116876714342015 1 ) 
      ( 0.5157053786241185 0.04326875377402137 1 ) 
        ( 0.5313952588331522 0.042378615659903 1 ) 
      ( 0.5470541557121839 0.04144944134744678 1 ) 
      ( 0.5626666158205507 0.04048419680718636 1 ) 
     ( 0.5782172315450762 0.039485826489522195 1 ) 
        ( 0.593690656305524 0.0384572461205747 1 ) 
     ( 0.6090716196998196 0.037401336812760505 1 ) 
      ( 0.6243449425740935 0.03632094047086331 1 ) 
      ( 0.6394955520026742 0.03521885645241817 1 ) 
      ( 0.6545084961632448 0.03409783942056344 1 ) 
     ( 0.6693689590924875 0.032960598308441155 1 ) 
      ( 0.6840622753076503 0.03180979629703788 1 ) 
     ( 0.6985739442796073 0.030648051693296024 1 ) 
     ( 0.7128896447431308 0.029477939582607394 1 ) 
     ( 0.7269952488302514 0.028301994119595303 1 ) 
     ( 0.7408768360127569 0.027122711313527698 1 ) 
     ( 0.7545207068400739 0.025942552159863144 1 ) 
      ( 0.7679133964589709 0.02476394596735382 1 ) 
      ( 0.7810416879017434 0.02358929373080549 1 ) 
     ( 0.7938926251297652 0.022420971402967574 1 ) 
     ( 0.8064535258195331 0.021261332925002503 1 ) 
     ( 0.8187119938785907 0.020112712883419988 1 ) 
      ( 0.8306559316789744 0.01897742867207945 1 ) 
      ( 0.8422735519961111 0.01785778205064566 1 ) 
      ( 0.853553389641386 0.016756060005484383 1 ) 
        ( 0.8644843127769004 0.015674534835124 1 ) 
      ( 0.8750555339012502 0.01461546339979274 1 ) 
     ( 0.8852566204954886 0.013581085492846475 1 ) 
      ( 0.8950775053187623 0.01257362131080364 1 ) 
     ( 0.9045084963434626 0.011595268017859497 1 ) 
     ( 0.9135402863200868 0.010648195419827915 1 ) 
     ( 0.9221639619623694 0.009734540781116963 1 ) 
     ( 0.9303710127436202 0.008856402836261587 1 ) 
     ( 0.9381533392955854 0.008015835064403627 1 ) 
      ( 0.9455032614015477 0.00721483831063556 1 ) 
     ( 0.9524135255757721 0.006455352852046209 1 ) 
      ( 0.9588773122218202 0.00573925001838952 1 ) 
     ( 0.9648882423626697 0.005068323487337753 1 ) 
     ( 0.9704403839359932 0.004444280382114217 1 ) 
     ( 0.9755282576483886 0.003868732304800629 1 ) 
    ( 0.9801468423827797 0.0033431864416923543 1 ) 
     ( 0.9842915801536527 0.002869036877692313 1 ) 
    ( 0.9879583806052372 0.0024475562548834096 1 ) 
    ( 0.9911436250481941 0.0020798879061494358 1 ) 
    ( 0.9938441700308243 0.0017670385881010595 1 ) 
    ( 0.9960573504412771 0.0015098719287370832 1 ) 
    ( 0.9977809821376927 0.0013091026943897535 1 ) 
    ( 0.9990133641036874 0.0011652919677620777 1 ) 
    ( 0.9997532801270506 0.0010788433145000886 1 ) 
                   ( 1.0 0.0010499999999999815 1 )  
	)																																																													
	spline	0	6													
	(
                                         ( 0.0 -0.0 0 ) 
 ( 0.00024671981657042874 -0.002316197204902843 0 ) 
  ( 0.0009866357836101902 -0.004600598129393101 0 ) 
  ( 0.0022190176933925554 -0.006852290391005644 0 ) 
   ( 0.003942649333762649 -0.009070141684821726 0 ) 
   ( 0.006155829688391956 -0.011252806756428759 0 ) 
   ( 0.008856374615475837 -0.013398736989871502 0 ) 
   ( 0.012041619003218151 -0.015506192495134982 0 ) 
   ( 0.015708419399974638 -0.017573256549436388 0 ) 
    ( 0.01985315711646002 -0.019597852218326335 0 ) 
    ( 0.02447174179695788 -0.021577760956684414 0 ) 
   ( 0.029559615456007327 -0.023510642966489373 0 ) 
    ( 0.03511175697658486 -0.025394059068060058 0 ) 
    ( 0.04112268706534028 -0.027225493824557356 0 ) 
    ( 0.047586473659998074 -0.02900237964613257 0 ) 
     ( 0.05449673778358616 -0.03072212159036338 0 ) 
     ( 0.06184665983971649 -0.03238212256965291 0 ) 
     ( 0.06962898634270315 -0.03397980867413402 0 ) 
    ( 0.07783603707587677 -0.035512654320327734 0 ) 
     ( 0.08645971267103159 -0.03697820694129733 0 ) 
       ( 0.0954915026015235 -0.0383741109432143 0 ) 
     ( 0.10492249358113281 -0.03969813066595252 0 ) 
     ( 0.11474337836040116 -0.04094817210134502 0 ) 
    ( 0.12494446491176331 -0.042122303141821256 0 ) 
     ( 0.13551568599440833 -0.04321877215399728 0 ) 
     ( 0.1464466090894303 -0.044236024696083474 0 ) 
      ( 0.1577264466954656 -0.04517271822433904 0 ) 
    ( 0.16934406697465365 -0.046027734661848146 0 ) 
     ( 0.18128800473841744 -0.04680019073220441 0 ) 
     ( 0.1935464727622202 -0.047489445990842184 0 ) 
      ( 0.20610737341813284 -0.0480951085173074 0 ) 
      ( 0.21895831061373222 -0.0486170382622798 0 ) 
       ( 0.2320866020255476 -0.0490553480732082 0 ) 
    ( 0.24547929161498316 -0.049410402451580855 0 ) 
     ( 0.2591231624143632 -0.049682814122716606 0 ) 
      ( 0.273004749570484 -0.049873438525149416 0 ) 
        ( 0.287110353632798 -0.0499833663508374 0 ) 
     ( 0.30142605407311807 -0.05001391428923613 0 ) 
       ( 0.315937723023497 -0.04996661414745782 0 ) 
      ( 0.3306310392187286 -0.04984320053505298 0 ) 
      ( 0.345491502129707 -0.049645597315207214 0 ) 
      ( 0.3605044462736979 -0.04937590303420085 0 ) 
       ( 0.3756550556873999 -0.0490363755477345 0 ) 
       ( 0.3909283785485107 -0.0486294160661414 0 ) 
     ( 0.40630934193137186 -0.04815755284058916 0 ) 
      ( 0.4217827666821252 -0.04762342470918232 0 ) 
     ( 0.43733338239870584 -0.04702976471551642 0 ) 
      ( 0.4529458425008854 -0.04637938400285951 0 ) 
       ( 0.468604739375493 -0.04567515617494655 0 ) 
      ( 0.4842946195818704 -0.04492000229960272 0 ) 
     ( 0.4999999991025516 -0.044116876714342015 0 ) 
      ( 0.5157053786241185 -0.04326875377402137 0 ) 
        ( 0.5313952588331522 -0.042378615659903 0 ) 
      ( 0.5470541557121839 -0.04144944134744678 0 ) 
      ( 0.5626666158205507 -0.04048419680718636 0 ) 
     ( 0.5782172315450762 -0.039485826489522195 0 ) 
        ( 0.593690656305524 -0.0384572461205747 0 ) 
     ( 0.6090716196998196 -0.037401336812760505 0 ) 
      ( 0.6243449425740935 -0.03632094047086331 0 ) 
      ( 0.6394955520026742 -0.03521885645241817 0 ) 
      ( 0.6545084961632448 -0.03409783942056344 0 ) 
     ( 0.6693689590924875 -0.032960598308441155 0 ) 
      ( 0.6840622753076503 -0.03180979629703788 0 ) 
     ( 0.6985739442796073 -0.030648051693296024 0 ) 
     ( 0.7128896447431308 -0.029477939582607394 0 ) 
     ( 0.7269952488302514 -0.028301994119595303 0 ) 
     ( 0.7408768360127569 -0.027122711313527698 0 ) 
     ( 0.7545207068400739 -0.025942552159863144 0 ) 
      ( 0.7679133964589709 -0.02476394596735382 0 ) 
      ( 0.7810416879017434 -0.02358929373080549 0 ) 
     ( 0.7938926251297652 -0.022420971402967574 0 ) 
     ( 0.8064535258195331 -0.021261332925002503 0 ) 
     ( 0.8187119938785907 -0.020112712883419988 0 ) 
      ( 0.8306559316789744 -0.01897742867207945 0 ) 
      ( 0.8422735519961111 -0.01785778205064566 0 ) 
      ( 0.853553389641386 -0.016756060005484383 0 ) 
        ( 0.8644843127769004 -0.015674534835124 0 ) 
      ( 0.8750555339012502 -0.01461546339979274 0 ) 
     ( 0.8852566204954886 -0.013581085492846475 0 ) 
      ( 0.8950775053187623 -0.01257362131080364 0 ) 
     ( 0.9045084963434626 -0.011595268017859497 0 ) 
     ( 0.9135402863200868 -0.010648195419827915 0 ) 
     ( 0.9221639619623694 -0.009734540781116963 0 ) 
     ( 0.9303710127436202 -0.008856402836261587 0 ) 
     ( 0.9381533392955854 -0.008015835064403627 0 ) 
      ( 0.9455032614015477 -0.00721483831063556 0 ) 
     ( 0.9524135255757721 -0.006455352852046209 0 ) 
      ( 0.9588773122218202 -0.00573925001838952 0 ) 
     ( 0.9648882423626697 -0.005068323487337753 0 ) 
     ( 0.9704403839359932 -0.004444280382114217 0 ) 
     ( 0.9755282576483886 -0.003868732304800629 0 ) 
    ( 0.9801468423827797 -0.0033431864416923543 0 ) 
     ( 0.9842915801536527 -0.002869036877692313 0 ) 
    ( 0.9879583806052372 -0.0024475562548834096 0 ) 
    ( 0.9911436250481941 -0.0020798879061494358 0 ) 
    ( 0.9938441700308243 -0.0017670385881010595 0 ) 
    ( 0.9960573504412771 -0.0015098719287370832 0 ) 
    ( 0.9977809821376927 -0.0013091026943897535 0 ) 
    ( 0.9990133641036874 -0.0011652919677620777 0 ) 
    ( 0.9997532801270506 -0.0010788433145000886 0 ) 
                   ( 1.0 -0.0010499999999999815 0 )  
    )
    spline 10 16
    (
                                         ( 0.0 -0.0 1 ) 
 ( 0.00024671981657042874 -0.002316197204902843 1 ) 
  ( 0.0009866357836101902 -0.004600598129393101 1 ) 
  ( 0.0022190176933925554 -0.006852290391005644 1 ) 
   ( 0.003942649333762649 -0.009070141684821726 1 ) 
   ( 0.006155829688391956 -0.011252806756428759 1 ) 
   ( 0.008856374615475837 -0.013398736989871502 1 ) 
   ( 0.012041619003218151 -0.015506192495134982 1 ) 
   ( 0.015708419399974638 -0.017573256549436388 1 ) 
    ( 0.01985315711646002 -0.019597852218326335 1 ) 
    ( 0.02447174179695788 -0.021577760956684414 1 ) 
   ( 0.029559615456007327 -0.023510642966489373 1 ) 
    ( 0.03511175697658486 -0.025394059068060058 1 ) 
    ( 0.04112268706534028 -0.027225493824557356 1 ) 
    ( 0.047586473659998074 -0.02900237964613257 1 ) 
     ( 0.05449673778358616 -0.03072212159036338 1 ) 
     ( 0.06184665983971649 -0.03238212256965291 1 ) 
     ( 0.06962898634270315 -0.03397980867413402 1 ) 
    ( 0.07783603707587677 -0.035512654320327734 1 ) 
     ( 0.08645971267103159 -0.03697820694129733 1 ) 
       ( 0.0954915026015235 -0.0383741109432143 1 ) 
     ( 0.10492249358113281 -0.03969813066595252 1 ) 
     ( 0.11474337836040116 -0.04094817210134502 1 ) 
    ( 0.12494446491176331 -0.042122303141821256 1 ) 
     ( 0.13551568599440833 -0.04321877215399728 1 ) 
     ( 0.1464466090894303 -0.044236024696083474 1 ) 
      ( 0.1577264466954656 -0.04517271822433904 1 ) 
    ( 0.16934406697465365 -0.046027734661848146 1 ) 
     ( 0.18128800473841744 -0.04680019073220441 1 ) 
     ( 0.1935464727622202 -0.047489445990842184 1 ) 
      ( 0.20610737341813284 -0.0480951085173074 1 ) 
      ( 0.21895831061373222 -0.0486170382622798 1 ) 
       ( 0.2320866020255476 -0.0490553480732082 1 ) 
    ( 0.24547929161498316 -0.049410402451580855 1 ) 
     ( 0.2591231624143632 -0.049682814122716606 1 ) 
      ( 0.273004749570484 -0.049873438525149416 1 ) 
        ( 0.287110353632798 -0.0499833663508374 1 ) 
     ( 0.30142605407311807 -0.05001391428923613 1 ) 
       ( 0.315937723023497 -0.04996661414745782 1 ) 
      ( 0.3306310392187286 -0.04984320053505298 1 ) 
      ( 0.345491502129707 -0.049645597315207214 1 ) 
      ( 0.3605044462736979 -0.04937590303420085 1 ) 
       ( 0.3756550556873999 -0.0490363755477345 1 ) 
       ( 0.3909283785485107 -0.0486294160661414 1 ) 
     ( 0.40630934193137186 -0.04815755284058916 1 ) 
      ( 0.4217827666821252 -0.04762342470918232 1 ) 
     ( 0.43733338239870584 -0.04702976471551642 1 ) 
      ( 0.4529458425008854 -0.04637938400285951 1 ) 
       ( 0.468604739375493 -0.04567515617494655 1 ) 
      ( 0.4842946195818704 -0.04492000229960272 1 ) 
     ( 0.4999999991025516 -0.044116876714342015 1 ) 
      ( 0.5157053786241185 -0.04326875377402137 1 ) 
        ( 0.5313952588331522 -0.042378615659903 1 ) 
      ( 0.5470541557121839 -0.04144944134744678 1 ) 
      ( 0.5626666158205507 -0.04048419680718636 1 ) 
     ( 0.5782172315450762 -0.039485826489522195 1 ) 
        ( 0.593690656305524 -0.0384572461205747 1 ) 
     ( 0.6090716196998196 -0.037401336812760505 1 ) 
      ( 0.6243449425740935 -0.03632094047086331 1 ) 
      ( 0.6394955520026742 -0.03521885645241817 1 ) 
      ( 0.6545084961632448 -0.03409783942056344 1 ) 
     ( 0.6693689590924875 -0.032960598308441155 1 ) 
      ( 0.6840622753076503 -0.03180979629703788 1 ) 
     ( 0.6985739442796073 -0.030648051693296024 1 ) 
     ( 0.7128896447431308 -0.029477939582607394 1 ) 
     ( 0.7269952488302514 -0.028301994119595303 1 ) 
     ( 0.7408768360127569 -0.027122711313527698 1 ) 
     ( 0.7545207068400739 -0.025942552159863144 1 ) 
      ( 0.7679133964589709 -0.02476394596735382 1 ) 
      ( 0.7810416879017434 -0.02358929373080549 1 ) 
     ( 0.7938926251297652 -0.022420971402967574 1 ) 
     ( 0.8064535258195331 -0.021261332925002503 1 ) 
     ( 0.8187119938785907 -0.020112712883419988 1 ) 
      ( 0.8306559316789744 -0.01897742867207945 1 ) 
      ( 0.8422735519961111 -0.01785778205064566 1 ) 
      ( 0.853553389641386 -0.016756060005484383 1 ) 
        ( 0.8644843127769004 -0.015674534835124 1 ) 
      ( 0.8750555339012502 -0.01461546339979274 1 ) 
     ( 0.8852566204954886 -0.013581085492846475 1 ) 
      ( 0.8950775053187623 -0.01257362131080364 1 ) 
     ( 0.9045084963434626 -0.011595268017859497 1 ) 
     ( 0.9135402863200868 -0.010648195419827915 1 ) 
     ( 0.9221639619623694 -0.009734540781116963 1 ) 
     ( 0.9303710127436202 -0.008856402836261587 1 ) 
     ( 0.9381533392955854 -0.008015835064403627 1 ) 
      ( 0.9455032614015477 -0.00721483831063556 1 ) 
     ( 0.9524135255757721 -0.006455352852046209 1 ) 
      ( 0.9588773122218202 -0.00573925001838952 1 ) 
     ( 0.9648882423626697 -0.005068323487337753 1 ) 
     ( 0.9704403839359932 -0.004444280382114217 1 ) 
     ( 0.9755282576483886 -0.003868732304800629 1 ) 
    ( 0.9801468423827797 -0.0033431864416923543 1 ) 
     ( 0.9842915801536527 -0.002869036877692313 1 ) 
    ( 0.9879583806052372 -0.0024475562548834096 1 ) 
    ( 0.9911436250481941 -0.0020798879061494358 1 ) 
    ( 0.9938441700308243 -0.0017670385881010595 1 ) 
    ( 0.9960573504412771 -0.0015098719287370832 1 ) 
    ( 0.9977809821376927 -0.0013091026943897535 1 ) 
    ( 0.9990133641036874 -0.0011652919677620777 1 ) 
    ( 0.9997532801270506 -0.0010788433145000886 1 ) 
                   ( 1.0 -0.0010499999999999815 1 )  
							
    )															
                                                                    
                                                                    
    );																
                                                                    
    faces																
    (																
                                                                    
    );																
                                                                    
    faces																
    (																
                                                                    
    );																
                                                                    
                                                                    
    defaultPatch																
    {																
        name frontAndBack;																
        type empty;																
    }		
                                                                                                                                
    boundary																
    (																
        inlet              																
            {																
            type patch;    																
            faces																
            (																
                (3 13 12 2)
                (8 18 13 3)
                (5 2 12 15)
                (8 9 19 18)															
            );																
            } 
        outlet              																
            {																
            type patch;    																
            faces																
            (																
                (4 5 15 14)
                (7 4 14 17)
                (7 17 19 9)  															
            );																
            }	

        foil              																
            {																
            type wall;    																
            faces																
            (																
                (0 1 11 10)
                (0 6 16 10)
                (6 1 11 16)															
            );																
            }	
                                                                
                                                                        
    );	
    // ************************************************************************* //																
                                                                    			               	
    